In [64]:
#repeat of assignment 4 except with pandas

#importing all necessary functions
import pandas as pd
import numpy as np

#saving the html data
census_data = pd.read_html("https://www.genealogybranches.com/censuscosts.html", thousands=',')

#finding some information out about the data
print ("This is the number of data sets the html has:" , len(census_data))

This is the number of data sets the html has: 2

In [65]:
#sorts the 2 dataframes 
df = census_data[0]
df.head()

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [66]:
#this second dataframe is not as useful as the first
df2 = census_data[1]
df2.head()

                                                   0
0  The U.S. population reached 300,000,000 on 17 ...

After looking at the 2 data sets the first clearly has the relevant data to explore.  

After getting a full preview of the data (shown below) there are some problems.

The information is not uniform (cents, $, Billions, *)

We now need to edit the data so everything is uniform.

In [67]:
#shows the user all the first dataframe
df

              0                 1               2                        3
0   Census Year  Total Population     Census Cost  Average Cost Per Person
1          1790           3929214         $44,377               1.13 cents
2          1800           5308483         $66,109               1.24 cents
3          1810           7239881        $178,445               2.46 cents
4          1820           9633822        $208,526               2.16 cents
5          1830          12866020        $378,545               2.94 cents
6          1840          17069458        $833,371               4.88 cents
7          1850          23191876      $1,423,351               6.14 cents
8          1860          31443321      $1,969,377               6.26 cents
9          1870          38558371      $3,421,198               8.87 cents
10         1880          50155783      $5,790,678              11.54 cents
11         1890          62979766     $11,547,127              18.33 cents
12         1900          76303387     $11,854,000              15.54 cents
13         1910          91972266     $15,968,000              17.07 cents
14         1920         105710620     $25,117,000              23.76 cents
15         1930         122775046     $40,156,000              32.71 cents
16         1940         131669275     $67,527,000              51.29 cents
17         1950         151325798     $91,462,000              60.44 cents
18         1960         179323175    $127,934,000              71.34 cents
19         1970         203302031    $247,653,000                    $1.22
20         1980         226542199  $1,078,488,000                    $4.76
21         1990         248718301  $2,492,830,000                   $10.02
22         2000         281421906    $4.5 Billion                   $15.99
23        2010*         308745538     $13 Billion                   $42.11

In [68]:
#creates a function that cleans the year
clean_year = df[0]

def cleanse_year(clean_year):
  clean_year = clean_year.replace('\*','',regex=True)
  return clean_year

print(cleanse_year(clean_year))

0     Census Year
1            1790
2            1800
3            1810
4            1820
5            1830
6            1840
7            1850
8            1860
9            1870
10           1880
11           1890
12           1900
13           1910
14           1920
15           1930
16           1940
17           1950
18           1960
19           1970
20           1980
21           1990
22           2000
23           2010
Name: 0, dtype: object

In [69]:
#creates a function that cleans the total population
clean_pop = df[1]

def cleanse_pop(clean_pop):
  clean_pop = clean_pop.replace('\,','',regex=True)
  return clean_pop

print(cleanse_pop(clean_pop))

0     Total Population
1              3929214
2              5308483
3              7239881
4              9633822
5             12866020
6             17069458
7             23191876
8             31443321
9             38558371
10            50155783
11            62979766
12            76303387
13            91972266
14           105710620
15           122775046
16           131669275
17           151325798
18           179323175
19           203302031
20           226542199
21           248718301
22           281421906
23           308745538
Name: 1, dtype: object

In [70]:
#creates a function that cleans the census cost
clean_cost = df[2]

def cleanse_cost(clean_cost):
  clean_cost = clean_cost.replace('\$','',regex=True)
  clean_cost = clean_cost.replace('\,','',regex=True)
  clean_cost = clean_cost.replace('4.5 Billion','4500000000',regex=True)
  clean_cost = clean_cost.replace('\ Billion','000000000',regex=True)
  return clean_cost

print(cleanse_cost(clean_cost))

0     Census Cost
1           44377
2           66109
3          178445
4          208526
5          378545
6          833371
7         1423351
8         1969377
9         3421198
10        5790678
11       11547127
12       11854000
13       15968000
14       25117000
15       40156000
16       67527000
17       91462000
18      127934000
19      247653000
20     1078488000
21     2492830000
22     4500000000
23    13000000000
Name: 2, dtype: object

In [71]:
#creates a function that cleans the average cost

clean_average = df[3]

def cleanse_average(clean_average):
  clean_average = clean_average.replace(' cents','',regex=True)
  clean_average = clean_average.replace('\$','',regex=True)
  clean_average = clean_average.replace('1.13','.0113',regex=True)
  clean_average = clean_average.replace('1.24','.0124',regex=True)
  clean_average = clean_average.replace('2.46','.0246',regex=True)
  clean_average = clean_average.replace('2.16','.0216',regex=True)
  clean_average = clean_average.replace('2.94','.0294',regex=True)
  clean_average = clean_average.replace('4.88','.0488',regex=True)
  clean_average = clean_average.replace('6.14','.0614',regex=True)
  clean_average = clean_average.replace('6.26','.0626',regex=True)
  clean_average = clean_average.replace('8.87','.0887',regex=True)
  clean_average = clean_average.replace('11.54','.1154',regex=True)
  clean_average = clean_average.replace('18.33','.1833',regex=True)
  clean_average = clean_average.replace('15.54','.1554',regex=True)
  clean_average = clean_average.replace('17.07','.1707',regex=True)
  clean_average = clean_average.replace('23.76','.2376',regex=True)
  clean_average = clean_average.replace('32.71','.3271',regex=True)
  clean_average = clean_average.replace('51.29','.5129',regex=True)
  clean_average = clean_average.replace('60.44','.6044',regex=True)
  clean_average = clean_average.replace('71.34','.0734',regex=True)
  return clean_average
  
print(cleanse_average(clean_average))

0     Average Cost Per Person
1                       .0113
2                       .0124
3                       .0246
4                       .0216
5                       .0294
6                       .0488
7                       .0614
8                       .0626
9                       .0887
10                      .1154
11                      .1833
12                      .1554
13                      .1707
14                      .2376
15                      .3271
16                      .5129
17                      .6044
18                      .0734
19                       1.22
20                       4.76
21                      10.02
22                      15.99
23                      42.11
Name: 3, dtype: object

In [75]:
#applies all the functions

df = df.apply(cleanse_year)
df = df.apply(cleanse_pop)
df = df.apply(cleanse_cost)
df = df.apply(cleanse_average)
df.head()

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214        44377                    .0113
2         1800           5308483        66109                    .0124
3         1810           7239881       178445                    .0246
4         1820           9633822       208526                    .0216

In [78]:
#this writes the csv file

df.to_csv("census_cost_cleansed.csv")

In [51]:
#THIS CODE WORKS BUT WHEN TRYING TO APPLY TO THE DATAFRAME IT APPLIES TO EVERY COLUMN - COULD NOT FIND SOLUTION TO ONLY APPLY 1 COLUMN
#creates a function that cleans the average cost

clean_average = df[3]

def cleanse_average(clean_average):
  clean_average = clean_average.replace(' cents','',regex=True)
  clean_average = clean_average.replace('\$','',regex=True)
  

  for x in range(0,19):
    try:
      temp = float(clean_average.iloc[x])
      clean_average.iloc[x] = temp/100
    except ValueError:
      clean_average

  return clean_average
  
print(cleanse_average(clean_average))

0     Average Cost Per Person
1                      0.0113
2                      0.0124
3                      0.0246
4                      0.0216
5                      0.0294
6                      0.0488
7                      0.0614
8                      0.0626
9                      0.0887
10                     0.1154
11                     0.1833
12                     0.1554
13                     0.1707
14                     0.2376
15                     0.3271
16                     0.5129
17                     0.6044
18                     0.7134
19                       1.22
20                       4.76
21                      10.02
22                      15.99
23                      42.11
Name: 3, dtype: object